Repository: Safius-Sifat/Mr-Meal
Catalog: lib/src/l10n/arb/app_*.arb
Languages: bn

# appDescription
source: Agrimate is a platform that connects farmers with buyers and provides them with the tools to manage their farm.
bn: এগ্রিমেট একটি সহজ এবং ব্যবহারযোগ্য অ্যাপ্লিকেশন যা আপনাকে আপনার কৃষি জমি পরিচালনা করতে সাহায্য করবে।

# appTitle
source: Agrimate
bn: এগ্রিমেট

# appSlogan
source: Every Farmer's friend
bn: সকল কৃষকের বন্ধু

# storageError
source: Oops, there's a problem accessing local storage.
bn: দুঃখিত, আপনার ডেটা স্থানীয়ভাবে সংরক্ষিত হয়নি।

source: Name
bn: আপনার নাম

source: Gender
bn: লিঙ্গ

# selectGender
source: Select your Gender
bn: লিঙ্গ নির্বাচন করুন

source: Male
bn: পুরুষ

source: Female
bn: মহিলা

source: Other
bn: অন্যান্য

source: Farmer
bn: কৃষক

source: Businessman
bn: ব্যবসায়ী

source: Profession
bn: পেশা

# selectProfession
source: Select your Profession
bn: পেশা নির্বাচন করুন

# welcome
source: Welcome to
bn: স্বাগতম

# selectLanguage
source: Select your language
bn: ভাষা নির্বাচন করুন

source: Home
bn: হোম

source: Login
bn: লগইন

source: Logout
bn: লগআউট

source: No
bn: না

source: Yes
bn: হ্যাঁ

# continueText
source: Continue
bn: এগিয়ে যান

source: Cancel
bn: বাতিল

source: OK
bn: ঠিক আছে

source: Close
bn: বন্ধ

source: Knowledge
bn: কৃষি জ্ঞান

source: Insurance
bn: বীমা

source: Market
bn: বাজার

source: Profile
bn: প্রোফাইল

source: Weather
bn: আবহাওয়া

source: Blog
bn: ব্লগ

# noBlog
source: No blog available
bn: কোন ব্লগ পাওয়া যায় নি

# noVideo
source: No video available
bn: কোন ভিডিও পাওয়া যায় নি

source: Videos
bn: ভিডিও

# noAccount
source: Don't have an account?
bn: এখনো একটি অ্যাকাউন্ট নেই?

# haveAccount
source: Already have an account?
bn: আগের অ্যাকাউন্ট আছে?

source: Register
bn: রেজিস্টার

source: Register Account
bn: রেজিস্টার অ্যাকাউন্ট

# registerDescription
source: Complete your details to create an account and continue
bn: আপনার তথ্য পূরণ করে একটি নতুন অ্যাকাউন্ট তৈরি করুন।

source: Forgot password?
bn: পাসওয়ার্ড ভুলে গেছেন?

source: Reset password
bn: পাসওয়ার্ড পুনরায় সেট করুন

source: Email
bn: ইমেইল

# doLogin
source: Login
bn: লগইন করুন

# doRegister
source: Register
bn: নতুন অ্যাকাউন্ট রেজিস্টার করুন

# emailSentText
source: We have sent you an Email
bn: আপনাকে একটি ইমেইল পাঠানো হয়েছে

# emailNotReceived
source: Didn't receive the email?
bn: এখনো ইমেইল পাওয়া যায়নি?

source: Send again
bn: পুনরায় পাঠান

# emailNotVerified
source: Your email is not verified yet. Please verify to continue
bn: আপনার ইমেইল ঠিকানা নিশ্চিত করা হয়নি। দয়াকরে ইমেইল চেক করুন।

# emailInUse
source: This email is already used. Try signing in .
bn: আপনার প্রদত্ত ইমেইলটি ইতিমধ্যে ব্যবহার করা হয়েছে। লগইন করার চেষ্টা করুন।

# passwordWeak
source: Your password is too weak.
bn: দয়াকরে, একটি শক্তিশালী পাসওয়ার্ড ব্যবহার করুন।

# resetPasswordError
source: Failed to send reset password email. Please try again later.
bn: দুঃখিত, আপনাকে ইমেইল পাঠানো যায় নি। আবার চেষ্টা করুন।

# resetPasswordSuccess
source: Click on the Password reset link sent to you on {email} to reset your password. Then log into your account.
bn: ইমেইল এ পাঠানো লিঙ্ক এ প্রবেশ করে আপনার পাসওয়ার্ড পুনরায় সেট করুন। তারপর আবার লগইন করুন।

# resetPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
bn: আপনার ইমেইল ঠিকানা প্রদান করুন এবং আপনাকে পাসওয়ার্ড পুনরায় সেট করার জন্য একটি লিঙ্ক পাঠানো হবে।

# emailVerficationLink
source: Click on the Email verification link sent to you on {email} Then click on next to continue.
bn: ইমেইল এ পাঠানো লিঙ্ক এ প্রবেশ করে আপনার ইমেইল ঠিকানাটি নিশ্চিত করুন। তারপর নিচের বাটনে ক্লিক করে এগিয়ে যান।

# unknownError
source: Something went wrong. Please try again later
bn: একটি সমস্যা হয়েছে, আবার চেষ্টা করুন।

# loginError
source: Your email or password is wrong
bn: দুঃখিত, আপনার ইমেইল অথবা পাসওয়ার্ড ভুল হয়েছে।

# noConnectionError
source: Slow or no network connection. Please check your internet settings.
bn: দুঃখিত, আপনার ইন্টারনেট সংযোগ নেই

source: Password
bn: পাসওয়ার্ড

source: Confirm Password
bn: কনফার্ম পাসওয়ার্ড

# confirmPasswordVerificationText
source: Your password do not match with the confirm password
bn: আপনার পাসওয়ার্ড উভয় ক্ষেত্রেই একই হতে হবে

# passwordVerificationText
source: Password must have minimum of 8 characters
bn: পাসওয়ার্ড অবশ্যই কমপক্ষে ৮ টি অক্ষর হতে হবে

# serverError
source: Server error occured. Please try again later.
bn: দুঃখিত, কিছু একটা সমস্যা হয়েছে। আবার চেষ্টা করুন।

# shortPasswordVerificationText
source: Password must have minimum of 6 characters
bn: পাসওয়ার্ড অবশ্যই কমপক্ষে ৮ টি অক্ষর হতে হবে

source: Sign In
bn: সাইন ইন

# loginWith
source: Or Login with Google
bn: অথবা লগইন করুন গুগল দিয়ে

# signInStatusError
source: Failed to sign in. Please try again later.
bn: দুঃখিত, সাইন ইন করা যায়নি। আবার চেষ্টা করুন।

source: Sign Out
bn: সাইন আউট

# validEmailVerificationText
source: Please input a valid email address
bn: একটি সঠিক ইমেইল ঠিকানা প্রদান করুন

# emptyStringVerificationText
source: This field cannot be empty
bn: এই ফিল্ডটি খালি রাখা যাবে না

# welcomeUser
source: Welcome {userName}
bn: স্বাগতম {userName}

# supermarket
source: Supermarket Price
bn: সুপারমার্কেট দাম

# wholesale
source: Wholesale Price
bn: হোলসেল দাম

# highEnd
source: HighEnd Price
bn: উচ্চ মানের দাম

source: Best Price
bn: সেরা দাম

# profileInfo
source: Profile Information
bn: প্রোফাইল তথ্য

# comingSoon
source: Insurance is Coming Soon
bn: বীমা ফিচারটি শীঘ্রই আসছে

# profileDescription
source: Please fill in the following details to complete your profile
bn: দয়াকরে আপনার নিম্নোক্ত প্রোফাইল তথ্য পূরণ করে অগ্রসর হোন।

# farmerInfo
source: Farmer Information
bn: কৃষকের তথ্য

source: Price by Region
bn: অঞ্চল অনুযায়ী দাম

source: Price by Outlet
bn: বিক্রয়কেন্দ্র অনুযায়ী দাম

source: Today
bn: আজ

source: Rain
bn: বৃষ্টি

source: Clear
bn: রৌদ্রজ্জ্বল

source: Clouds
bn: মেঘলা

source: Daily Forecast
bn: দৈনিক পূর্বাভাস

source: Feels like
bn: মনে হচ্ছে

source: Humidity
bn: আর্দ্রতা

source: Wind
bn: বাতাসের গতি

# dailySummary
source: Daily Summary ({date})
bn: দৈনিক পরামর্শ ({date})

source: Retry
bn: পুনরায় চেষ্টা করুন

# weatherError
source: Could not fetch current weather data. Please try again later.
bn: আপনার আবহাওয়া তথ্য পাওয়া যায়নি। আবার চেষ্টা করুন।

# locationServiceError
source: Location service is disabled. Please enable location service to view weather data of your location.
bn: আপনার ফোন এর লোকেশন সেবা অফ করা হয়েছে। দয়াকরে লোকেশন সেবা চালু করে, আবার চেষ্টা করুন।

# permissionDeniedError
source: You have denied permission to access your location. Please enable location access to view weather data of your location.
bn: আপনি আপনার লোকেশন অ্যাক্সেস অনুমতি দেননি। আপনার লোকেশন দেখার জন্য এই অনুমতি প্রয়োজন। দয়াকরে অনুমতি প্রদান করে আবার চেষ্টা করুন।

# permissionDeniedForeverError
source: You have permanently denied permission to access your location. This permission is required to view weather data of your location. Please enable location access from your device settings.
bn: আপনি আপনার লোকেশন অ্যাক্সেস অনুমতি দেননি। আপনার লোকেশন দেখার জন্য এই অনুমতি প্রয়োজন। দয়াকরে আপনার ডিভাইস সেটিংস থেকে লোকেশন অ্যাক্সেস চালু করুন।

source: Update Available
bn: নতুন আপডেট

# downloadSize
source: Download size: {size} MB
bn: ডাউনলোড সাইজ: {size} এমবি

# newVersion
source: New Version: {version}
bn: নতুন সংস্করণ: {version}

# updateDescription
source: A new version of Agrimate is available. Please update to the latest version.
bn: এগ্রিমেট এর নতুন সংস্করণ চলে এসেছে। নতুন ফিচার এবং সুবিধা পেতে এখনি আপডেট করুন।

source: UPDATE
bn: আপডেট করুন

source: NO THANKS
bn: না, ধন্যবাদ

source: Downloading Update...
bn: ডাউনলোড চলছে...

# downloadUpdate
source: Please wait while we download the update
bn: দয়াকরে নতুন সংস্করণ ডাউনলোড হওয়ার জন্য অপেক্ষা করুন।

# installPermissionDeniedError
source: Please enable permission to install the update.
bn: আপনি দয়াকরে এপ্লিকেশন ইনস্টল করার অনুমতি দিন।
